---
kind: type
id: T:Autodesk.Revit.DB.TessellatedFace
source: html/6b007c37-6c87-50c5-8cf3-c3c68aa130ae.htm
---
# Autodesk.Revit.DB.TessellatedFace

Defines a planar face bounded by a polyline in 3d space. A face
 consists of a single connected component and can have holes.

## Syntax (C#)
```csharp
public class TessellatedFace : IDisposable
```